[
    {
        "author": "MrVogue01",
        "title": "50 Types Of Fashion Styles With Pictures 2023",
        "description": "Today, many concepts of fashion style have been formed and become popular. People often use glamor and elegance to describe the classic fashion style. Like classic fashion, Vintage and Retro style outfits are also inspired by the past but are more diverse and easier to apply in everyday fashion. This article will introduce the top 50 hottest fashion styles.",
        "date": "2024-06-02",
        "link": "https://www.hoodmwr.com/types-of-fashion-styles-with-pictures/"
    },
    {
        "author": "ModernDesigner",
        "title": "Features of modern fashion",
        "description": "The article touches on the current topic of modern fashion. The main attention is paid to the development of this phenomenon as a socio-cultural one. The basis of the fashion trend is made up of various styles, images that contribute to the self-expression of personality in different eras. Thus, modern fashion acts as an indicator of the development of society.",
        "date": "2024-06-02",
        "link": "https://moluch.ru/archive/311/70303/"
    },
    {
        "author": "StyleMaster",
        "title": "British VOGUE",
        "description": "Preppy Style Will Reign Supreme This Summer - '90s Vogue Editor Plum Sykes Recalls How She Nailed The Look",
        "date": "2024-05-31",
        "link": "https://www.vogue.co.uk/fashion/fashion-trends"
    },
    {
        "author": "StyleMaster",
        "title": "VOGUE FRANCE",
        "description": "The 19 key fashion trends to know for Spring/Summer 2024",
        "date": "2024-06-01",
        "link": "https://www.vogue.fr/galerie/spring-summer-2024-fashion-trends"
    },
    {
        "author": "ModerStyleFrance",
        "title": "What you didn't know about Vogue. Interesting facts",
        "description": "Have you ever wondered who has been the most popular Vogue cover model for 128 years? How many issues have been published in total? Which celebrities got on the cover of the magazine, and were there royals?\r\n\r\nHere we will highlight some interesting facts about Vogue in numbers.",
        "date": "2024-06-03",
        "link": "https://www.livemaster.ru/topic/3371620-article-chego-vy-ne-znali-o-vogue-interesnye-fakty"
    },
    {
        "author": "StyleMaster",
        "title": "Fashion Trends",
        "description": "The Almond-Toed Shoes That Diana, Princess Of Wales Lived In Are Back",
        "date": "2024-06-03",
        "link": "https://www.vogue.co.uk/article/princess-diana-almond-shoes"
    }
]